Importing flat files using pandas.

Data comes in various ways, and before we work with tons of data, we need to import it. 

Here are the example of how to import a .csv file and Excel spreadsheets using pandas.

In [19]:
#import the library as pd
import pandas as pd

In [20]:
#assign the file name, in this case, I put iris.csv in the same directory as my workspace
file = 'iris.csv'

In [21]:
#read the csv file and assign its value into data
data = pd.read_csv(file)

In [22]:
#show the first 5 records of data
data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

====================================

In [23]:
#assign the file name, in this case, I put battledeath.xlsx in the same directory as my workspace
excelfile = 'battledeath.xlsx'

In [24]:
#read the excel file
data = pd.ExcelFile(excelfile)

In [25]:
#because excel is not a flat file, we can use this code to shows how many sheets the file has
data.sheet_names

['2002', '2004']

In [26]:
#once we know how many sheets the file has, we also know the name of the sheet which will help us to select a particular sheet.
#we can either pass the name of the sheet as an argument

df1 = data.parse('2002')

In [27]:
#or we can directly pass the index of the sheet, because pandas is clever enough to know if you are telling it the sheet name or the index
df2 = data.parse(1)

In [28]:
#show the first 5 records of data
df1.head()

  War, age-adjusted mortality due to       2002
0                        Afghanistan  36.083990
1                            Albania   0.128908
2                            Algeria  18.314120
3                            Andorra   0.000000
4                             Angola  18.964560

In [29]:
#show the first 5 records of data
df2.head()

  War(country)      2004
0  Afghanistan  9.451028
1      Albania  0.130354
2      Algeria  3.407277
3      Andorra  0.000000
4       Angola  2.597931